## Plan Result (stg-global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;dss-update-case&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
* Delete
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fis-ds-update-web&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat"
        name                                 = "hmcts-aat"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (11 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fis-ds-update-web" -> "healthProbeSettings-dss-update-case"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/fis-ds-update-web"
          ~ load_balancing_name = "loadBalancingSettings-fis-ds-update-web" -> "loadBalancingSettings-dss-update-case"
          ~ name                = "fis-ds-update-web" -> "dss-update-case"

            # (1 unchanged block hidden)
        }

      ~ backend_pool_health_probe {
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-fis-ds-update-web"
          ~ name                = "healthProbeSettings-fis-ds-update-web" -> "healthProbeSettings-dss-update-case"
            # (5 unchanged attributes hidden)
        }

      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-fis-ds-update-web"
          ~ name                            = "loadBalancingSettings-fis-ds-update-web" -> "loadBalancingSettings-dss-update-case"
            # (3 unchanged attributes hidden)
        }

      ~ frontend_endpoint {
            id                                      = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/frontendEndpoints/fis-ds-update-web"
          ~ name                                    = "fis-ds-update-web" -> "dss-update-case"
          ~ web_application_firewall_policy_link_id = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/fisdsupdatewebaat" -> "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/dssupdatecaseaat"
            # (3 unchanged attributes hidden)
        }

      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fis-ds-update-web",
              + "dss-update-case",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/fis-ds-update-web"
          ~ name               = "fis-ds-update-web" -> "dss-update-case"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "fis-ds-update-web" -> "dss-update-case"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fis-ds-update-web",
              + "dss-update-case",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/fis-ds-update-webHttpsRedirect"
          ~ name               = "fis-ds-update-webHttpsRedirect" -> "dss-update-caseHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (309 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["dss-update-case"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/frontendEndpoints/dss-update-case"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["fis-ds-update-web"] will be destroyed
  # (because key ["fis-ds-update-web"] is not in for_each map)
  - resource "azurerm_frontdoor_firewall_policy" "custom" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [
          - "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourcegroups/lz-aat-rg/providers/Microsoft.Network/frontdoors/hmcts-aat/frontendendpoints/fis-ds-update-web",
        ] -> null
      - id                                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/fisdsupdatewebaat" -> null
      - location                          = "global" -> null
      - mode                              = "Detection" -> null
      - name                              = "fisdsupdatewebaat" -> null
      - resource_group_name               = "lz-aat-rg" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "High"
          - "environment"  = "staging"
        } -> null

      - managed_rule {
          - type    = "DefaultRuleSet" -> null
          - version = "1.0" -> null

          - exclusion {
              - match_variable = "QueryStringArgNames" -> null
              - operator       = "Equals" -> null
              - selector       = "rf" -> null
            }
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1474,"Program":"tfcmt","SHA1":"","Target":"stg-global","Vars":{}} -->